src/test/resources/betamax/tapes/Payments/can_validate.yaml

name: can_validate
interactions:
- request:
    method: POST
    uri: http://localhost:5555/v2/payments/validate
    body: currency=EUR&beneficiary_id=60fbe8d3-f7d0-4124-9077-93d09fb2186a&amount=788.44&reason=Invoice&reference=REF-INV-1838&unique_request_id=a20bc586-b7a9-4316-9daf-d4ede4c0d3df
    headers:
      X-Auth-Token:
      - 6f5f99d1b860fc47e8a186e3dce0d3f9
      User-Agent:
      - CurrencyCloudSDK/2.0 Java/4.1.3
  response:
    status: 200
    headers:
      Server:
      - nginx
      Date:
      - Mon, 01 Jan 2018 12:34:56 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '852'
      Connection:
      - keep-alive
      X-Request-Id:
      - '2778807612227406608'
      X-Content-Type-Options:
      - nosniff
    body: '{"validation_result":"success"}'