src/test/resources/mappings/Payments/can_validate.json

{
  "request": {
    "url": "/v2/payments/validate",
    "method": "POST",
    "headers": {
      "User-Agent": {
        "matches": "CurrencyCloudSDK/2.0 Java/5.12.0"
      },
      "X-Auth-Token": {
        "matches": "6f5f99d1b860fc47e8a186e3dce0d3f9"
      }
    },
    "bodyPatterns": [
      {
        "equalTo": "currency=EUR&beneficiary_id=60fbe8d3-f7d0-4124-9077-93d09fb2186a&amount=788.44&reason=Invoice&reference=REF-INV-1838&unique_request_id=a20bc586-b7a9-4316-9daf-d4ede4c0d3df"
      }
    ]
  },
  "response": {
    "status": 200,
    "headers": {
      "Server": "cloudflare",
      "Date": "Mon, 05 Jul 2021 12:30:46 GMT",
      "Content-Type": "application/json;charset=utf-8",
      "Connection": "keep-alive",
      "X-Request-Id": "1d859c7d-0992-4823-85ec-c043991d2b12",
      "X-Content-Type-Options": "nosniff"
    },
    "body": "{\"validation_result\":\"success\"}"
  }
}
